{
  "text": "\n\nChapter 5 Software Project Management \n \nProject scheduling \nProject scheduling is a process that allows you to create a schedule that you can \nuse to keep track of tasks and deadlines within a project. Project scheduling is a \nmechanism to communicate what tasks need to get done and which organizational \nresources will be allocated to complete those tasks in what timeframe.  It provides \nlike  start  and  end  date  of  the  project,  milestones  and  tasks  for  the project. It \nspecifies  the  resources  like  people,  equipment  etc.  required  to  complete  the \nproject and dependencies   of tasks of the project on each other. \nProject Scheduling Process: \nProject schedules may simply be represented in a table or spreadsheet showing \nthe tasks, effort, expected duration, and task dependencies. Project scheduling is \nthe process of deciding how the work in a project will be organized as separate \ntasks, and when and how these tasks will be executed. \n \n1. Identify Activities: \nBreak the whole project into smaller, manageable tasks/activities. Each activity \nshould  have  a  clear  start  and  end  point. Example:  In  a  software  project – \nrequirements gathering, design, coding, testing, deployment. \n2. Identify Activity Dependencies: \nDetermine the sequence of activities. Some activities can start only after another \nfinishes (dependent tasks). \nDependencies are usually of four types: \n\nFinish-to-Start (FS): Task B starts after Task A finishes. \nStart-to-Start (SS): Task B can start when Task A starts. \nFinish-to-Finish (FF): Task B can finish only when Task A finishes. \nStart-to-Finish (SF): Rare; Task B can finish only when Task A starts. \n3. Allocate Resources: \nAssign resources (equipment, software tools, budget, materials) needed for each \nactivity. Ensure resources are available when required to avoid project delays. \n4. Create Project Charts: \nUse tools like: \nGantt Chart → Shows timeline of activities, start/end dates, and progress. \nPERT/CPM Chart → Shows dependencies and critical path. \nThese charts help visualize the workflow, dependencies, and time allocation. \n5. Allocate People to Activities: \nAssign the right team members based on their skills and availability. Define roles \nand responsibilities clearly. Avoid overloading one person with too many tasks \nat the same time. \n \nWork Breakdown Structure  \nA Work Breakdown Structure (WBS) is a hierarchical decomposition of a project \ninto smaller, more manageable parts (modules, tasks, and activities). It helps in \nplanning,  scheduling,  resource  allocation,  cost  estimation,  and  tracking  the \nprogress of a software project. The root of this tree (structure) is labelled by the \nProject name itself. For constructing a work breakdown structure, each node is \nrecursively  decomposed  into  smaller  sub-activities,  until  at  the  leaf  level,  the \nactivities become undividable and independent. It follows a Top-Down approach. \n \n \n\nFeatures of WBS \n Breaks complex projects into manageable components. \n Each level gives more detail (from broad project → to modules → to tasks \n→ to activities). \n Follows a hierarchical tree structure. \n Supports project scheduling and resource allocation. \nLevels of WBS in Software Engineering \nLevel 1 – Project Goal \nThe complete software system (e.g., \"Library Management System\"). \nLevel 2 – Major Modules / Deliverables \nRequirements Analysis, System Design, Implementation, Testing, Deployment, \nMaintenance \nLevel 3 – Sub-Modules / Activities \nRequirements  Analysis  →  Gather  requirements,  Document  requirements, \nValidate requirements. \nSystem Design → High-level design, Database design, UI design. \nImplementation → Coding, Integration. \nTesting → Unit testing, Integration testing, System testing. \nDeployment → Installation, User training. \nMaintenance → Bug fixing, Updates. \nLevel 4 – Work Packages \nThe smallest manageable task assigned to individuals. \nExample: WBS for Library Management System  \nLevel 1: Library Management System \n Level 2: Requirements Analysis \n     – Gather requirements \n\n     – Document requirements \n    Level 2: System Design \n     – High-level design \n     – Database design \n     – UI design \n    Level 2: Implementation \n     – Develop login module \n     – Develop search module \n     – Develop issue/return module \n    Level 2: Testing \n     – Unit testing \n     – Integration testing \n    Level 2: Deployment \n     – Installation \n     – User training \n    Level 2: Maintenance \n     – Bug fixing \n     – Enhancements \nDiagram (Tree Representation of WBS) \nOnline Shopping System \n├── Requirements Analysis \n│   ├── Gather requirements \n│   ├── Create SRS document \n│   └── Validate requirements \n\n├── System Design \n│   ├── High-level design \n│   ├── Database design \n│   └── UI design \n├── Implementation \n│   ├── User registration module \n│   ├── Product catalog module \n│   ├── Shopping cart module \n│   └── Payment gateway module \n├── Testing \n│   ├── Unit testing \n│   ├── Integration testing \n│   ├── System testing \n│   └── UAT \n├── Deployment \n│   ├── Server setup \n│   ├── Software installation \n│   └── User training \n└── Maintenance \n    ├── Bug fixing \n    └── Updates \nActivity Network \nan activity network is a graphical representation of a project's tasks, showing their \ndependencies  and  logical  sequence. It  uses  nodes  for  activities  and  arrows  to \nillustrate  the  flow  and  relationships  between  them,  including  both  parallel  and \n\nsequential  tasks. This  visual  tool  helps  in  planning,  tracking,  and analysing a \nsoftware project. \nThere  are  two  ways  of  showing  activities  and  their  relationships.  Activity  on \nNodes (AON) and Activity on Arrows (AOA). \nIn AON network diagram, activities are represented by circles or ovals and the \nsequence in which the activities have to be carried out is shown by 'arrows'. \n \nThe  circles  representing  the  activities  are  labeled as  A,  B,  C  and  so  on.  The \nduration of an activity is shown below the labels. The arrows show the sequence \nin which the activities need to be executed. \nThe activities of the above project can also be represented by the AOA network \ndiagram. \n \n \nIn the AOA network diagram, activities are represented by arrows. The nodes are \nthe  events  that  are  either  the  beginning  or  end  of  activities.  The  nodes  are \nnumbered  serially  and  the  activities  are  identified  by  their  start  and  end  node \nnumbers. \n \n \n\nProject Tracking \nProject  Tracking is  the  process  of monitoring,  measuring,  and  controlling  the \nprogress of a software project to ensure it stays on schedule, within budget, and \nmeets the planned quality standards. \n1. Timeline Chart \nA Timeline Chart is a graphical representation of the schedule of activities in a \nsoftware project, showing when tasks start, how long they take, and when they \nend. \nIt  helps  visualize  project  progress  over  time  and  is  often  used  for  planning, \ntracking, and communicating project status. The main aim of timeline chart is to \nmake it easier to capture a process as a sequence of events and to understand all \ndependencies  within  a  project,  estimating  the  time  that  it  takes  every  step  or \nmoney that will be needed to complete it.  \n Purpose of a Timeline Chart \n Shows the sequence and duration of project activities. \n Helps identify overlaps and dependencies. \n Provides a clear schedule overview for the team and stakeholders. \n Useful for monitoring deadlines and adjusting resources. \n  Example: Timeline Chart for a Library Management System \n    Phases and Duration: \n Requirement Analysis → 2 weeks \n System Design → 2 weeks \n Development → 4 weeks \n Testing → 2 weeks \n Deployment → 1 week \nTimeline Representation (Gantt-style): \n \n\n \n2. Earned Value Analysis (EVA)  \nEarned Value Analysis (EVA) is also called \"Budget cost of work performed\". \nEarned  Value  Analysis  (EVA) is  a project  management  technique used  to \nmeasure  a  software  project’s  performance  in  terms  of cost  and  schedule. It \nintegrates cost, schedule, and scope to provide a comprehensive view of project \nhealth.  EVA helps assess whether a project is on track, under budget, or ahead \nof schedule, enabling proactive decision-making. \nKey Concepts in EVA: \n Planned Value (PV): \nThe  budgeted cost  of  the  work  planned  to  be  completed  by  a  certain  point  in \ntime. It represents the value of the work that should have been accomplished. \n Earned Value (EV): \nPhase Wee\nk 1 \nWee\nk 2 \nWee\nk 3 \nWee\nk 4 \nWee\nk 5 \nWee\nk 6 \nWee\nk 7 \nWee\nk 8 \nWee\nk 9 \nWee\nk 10 \nW\nee\nk \n11 \nRequi\nreme\nnt \nAnaly\nsis \n██\n██\n██ \n██\n██\n██ \n         \nSyste\nm \nDesig\nn \n  ██\n██\n██ \n██\n██\n██ \n       \nDevel\nopme\nnt \n   ██\n██\n██ \n██\n██\n██ \n██\n██\n██ \n██\n██\n██ \n    \nTesti\nng \n       ██\n██\n██ \n██\n██\n██ \n  \nDeplo\nymen\nt \n         ██\n██\n██ \n \n\nThe budgeted cost of the work actually completed by a certain point in time. It \nrepresents the value of the work that has been accomplished. \n Actual Cost (AC): \nThe real cost incurred to complete the work performed by a certain point in time. \nExample in Software Engineering: \nConsider a software development project with a total budget of $100,000 and a \nplanned  duration  of  10  weeks. After  5  weeks  (mid-point  of  the  project),  the \nfollowing data is collected: \n Planned Value (PV): At 5 weeks, 50% of the project should be completed, so \nPV = 50% of $100,000 = $50,000. \n Earned Value (EV): The project team has completed features worth 40% of the \ntotal project scope. So, EV = 40% of $100,000 = $40,000. \n Actual Cost (AC): The actual expenses incurred up to this point are $45,000. \nEVA Metrics Calculation: \n Schedule Variance (SV): \nSV = EV - PV = $40,000 - $50,000 = -$10,000. \nA negative SV indicates the project is behind schedule. \n Cost Variance (CV): \nCV = EV - AC = $40,000 - $45,000 = -$5,000. \nA negative CV indicates the project is over budget. \n Schedule Performance Index (SPI): \nSPI = EV / PV = $40,000 / $50,000 = 0.8. \nAn SPI less than 1 indicates the project is behind schedule.  \n Cost Performance Index (CPI): \nCPI = EV / AC = $40,000 / $45,000 = 0.89. \nA CPI less than 1 indicates the project is over budget. \n \nIn this example, the negative SV and CV, along with SPI and CPI values less than \n1, indicate that the software project is both behind schedule and over budget at \nthe 5-week mark. This information allows the project manager to identify issues \nearly  and  take  corrective  actions,  such  as  reallocating  resources,  adjusting  the \nscope, or revising the schedule, to bring the project back on track. \n3. Gantt chart \n Generalized Activity Normalization Time Table (GANTT) chart is type of \nchart in which series of horizontal lines are present that show the amount of work \ndone  or  production  completed  in  given  period  of  time  in  relation  to  amount \n\nplanned  for  those  projects. A  Gantt  chart  is  a  visual  tool  used  in  project \nmanagement to illustrate a project schedule. It displays the start and end dates of \nvarious tasks within a project, represented as horizontal bars against a timeline. \nIt is similar to bar chart. It visualizes a project schedule from start to finish. It is \nsimply  used  for  graphical  representation  of  schedule  that  helps  to  plan  in  an \nefficient   way,   coordinate,   and   track   some   particular   tasks   in   project.  \n \nThe purpose of Gantt chart is to emphasize scope of individual tasks. Hence set \nof  tasks is given  as input  to  Gantt  chart.  Gantt  chart is  also  known  as timeline \nchart. It can be developed for entire project or it can be developed for individual \nfunctions. In most of projects, after generation of timeline chart, project tables are \nprepared. In project tables, all tasks are listed in proper manner along with start \ndate and end date and information related to it.  \n \nProject Scheduling Techniques \nCritical Path Method \nIn project management, the critical path is the longest sequence of tasks that must \nbe completed to execute a project. The tasks on the critical path are called critical \nactivities  because  if  they’re  delayed,  the whole  project  completion  will  be \ndelayed. To find the critical path, project managers use the critical path method \n(CPM). \n\nWhat Is the Critical Path Method (CPM)? \nThe critical path method (CPM) is a project management technique that’s used \nby  project  managers  to  create  an  accurate project  schedule. The  CPM  method, \nalso known as critical path analysis (CPA), consists in using the CPM formula \nand a network diagram to visually represent the task sequences of a project. Once \nthese task sequences or paths are defined, their duration is calculated to identify \nthe critical path. \n \nThe arrows indicate the sequence of activities. We'll mark the Earliest Start (ES) \ntime  to  the  left  of  the  activity,  and  the  Earliest  Finish  (EF)  time  to  the  right\n \n \n\n \nThe longest path will be the “critical path”. \nPert chart \nA PERT chart is a network diagram that allows project managers to create project \nschedules. They’re used in the Program Evaluation Review Technique (PERT) to \nrepresent  a  project  timeline,  estimate  the  duration  of  tasks,  identify  task \ndependencies and find the critical path of a project. It contains nodes and arrows. \nNodes represent events or tasks. Arrow represents dependencies between tasks. \nIt is a project scheduling and planning tool used to: \n Represent project activities and their dependencies in a network diagram. \n Estimate time duration more realistically using three estimates: \no Optimistic time (O): Minimum possible time. \no Most likely time (M): Normal/expected time. \no Pessimistic time (P): Maximum possible time. \n Expected time for each activity is calculated as: \nTE=(O+4M+P) /6 \nExample PERT Problem \nSuppose we have the following activities: \nActivity Predecessor(s) Optimistic (O) Most Likely (M) Pessimistic (P) \nA – 2 4 \n6 \nB A 3 5 \n9 \nC A 2 3 \n4 \n\nActivity Predecessor(s) Optimistic (O) Most Likely (M) Pessimistic (P) \nD B, C 4 6 \n10 \nE C 3 4 \n5 \nF D, E 2 3 \n4 \n     A(4) \n    /       \\ \n  B(5)   C(3) \n    |       /      \\ \n   D(6)     E(4) \n     \\      / \n       F(3) \n \nStep 1: Calculate Expected Time (TE) \nTE=(O+4M+P) /6 \n A: (2 + 4×4 + 6) / 6 = 4 \n B: (3 + 4×5 + 9) / 6 = 5.33 ≈ 5 \n C: (2 + 4×3 + 4) / 6 = 3 \n D: (4 + 4×6 + 10) / 6 = 6.33 ≈ 6 \n E: (3 + 4×4 + 5) / 6 = 4 \n F: (2 + 4×3 + 4) / 6 = 3 \nStep 2: Draw Network & Paths \nDependencies: \n A → B → D → F \n A → C → D → F \n A → C → E → F \nStep 3: Path Durations \n Path 1: A (4) + B (5) + D (6) + F (3) = 18 \n Path 2: A (4) + C (3) + D (6) + F (3) = 16 \n Path 3: A (4) + C (3) + E (4) + F (3) = 14 \n\nStep 4: Critical Path \n Critical Path = A → B → D → F \n Project Expected Duration = 18 days \n Final Answer \n PERT Chart shows activities, dependencies, and time estimates. \n Critical path: A → B → D → F \n Project completion time (expected): 18 days \n "
}